


Internet Engineering Task Force                                 H. Singh
Internet-Draft                                                 W. Beebee
Intended status: Informational                       Cisco Systems, Inc.
Expires: April 28, 2011                                        C. Donley
                                                               CableLabs
                                                                B. Stark
                                                                    AT&T
                                                           O. Troan, Ed.
                                                     Cisco Systems, Inc.
                                                        October 25, 2010


          Advanced Requirements for IPv6 Customer Edge Routers
               draft-wbeebee-v6ops-ipv6-cpe-router-bis-04

Abstract

   This document continues the work undertaken by the IPv6 CE Router
   Phase I work in the IETF v6ops Working Group.  Advanced requirements
   or Phase II work is covered in this document.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 28, 2011.

Copyright Notice

   Copyright (c) 2010 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect



Singh, et al.            Expires April 28, 2011                 [Page 1]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
     1.1.  Requirements Language  . . . . . . . . . . . . . . . . . .  3
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  3
   3.  Conceptual Configuration Variables . . . . . . . . . . . . . .  4
   4.  Architecture . . . . . . . . . . . . . . . . . . . . . . . . .  4
   5.  Advanced Features and Feature Requirements . . . . . . . . . .  6
     5.1.  DNS  . . . . . . . . . . . . . . . . . . . . . . . . . . .  6
     5.2.  Multicast Behavior . . . . . . . . . . . . . . . . . . . .  6
     5.3.  ND Proxy . . . . . . . . . . . . . . . . . . . . . . . . .  7
     5.4.  Prefix Delegation on LAN interface(s) (More details
           are TBD) . . . . . . . . . . . . . . . . . . . . . . . . .  8
     5.5.  Routed network behavior(General Cases TBD) . . . . . . . .  8
     5.6.  Transition Technologies Support  . . . . . . . . . . . . .  9
       5.6.1.  Dual-Stack(DS)-Lite  . . . . . . . . . . . . . . . . .  9
       5.6.2.  6rd  . . . . . . . . . . . . . . . . . . . . . . . . . 10
       5.6.3.  Transition Technologies Coexistence  . . . . . . . . . 10
     5.7.  Quality Of Service . . . . . . . . . . . . . . . . . . . . 11
     5.8.  Unicast Data Forwarding  . . . . . . . . . . . . . . . . . 11
     5.9.  ZeroConf . . . . . . . . . . . . . . . . . . . . . . . . . 11
   6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 11
   7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 11
   8.  Contributors . . . . . . . . . . . . . . . . . . . . . . . . . 12
   9.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 12
   10. References . . . . . . . . . . . . . . . . . . . . . . . . . . 12
     10.1. Normative References . . . . . . . . . . . . . . . . . . . 12
     10.2. Informative References . . . . . . . . . . . . . . . . . . 15
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 15
















Singh, et al.            Expires April 28, 2011                 [Page 2]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


1.  Introduction

   This document defines Advanced IPv6 features for a residential or
   small office router referred to as an IPv6 CE router.  Typically
   these routers also support IPv4.  The IPv6 End-user Network
   Architecture for such a router is described in
   [I-D.ietf-v6ops-ipv6-cpe-router].  This version of the document
   includes the requirements for Advanced features.

1.1.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].


2.  Terminology

   End-user Network          one or more links attached to the IPv6 CE
                             router that connect IPv6 hosts.

   IPv6 Customer Edge router a node intended for home or small office
                             use which forwards IPv6 packets not
                             explicitly addressed to itself.  The IPv6
                             CE router connects the end-user network to
                             a service provider network.

   IPv6 host                 any device implementing an IPv6 stack
                             receiving IPv6 connectivity through the
                             IPv6 CE router

   LAN interface             an IPv6 CE router's attachment to a link in
                             the end-user network.  Examples are
                             Ethernets (simple or bridged), 802.11
                             wireless or other LAN technologies.  An
                             IPv6 CE router may have one or more network
                             layer LAN Interfaces.

   Service Provider          an entity that provides access to the
                             Internet.  In this document, a Service
                             Provider specifically offers Internet
                             access using IPv6, and may also offer IPv4
                             Internet access.  The Service Provider can
                             provide such access over a variety of
                             different transport methods such as DSL,
                             cable, wireless, and others.





Singh, et al.            Expires April 28, 2011                 [Page 3]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


   WAN interface             an IPv6 CE router's attachment to a link
                             used to provide connectivity to the Service
                             Provider network; example link technologies
                             include Ethernets (simple or bridged), PPP
                             links, Frame Relay, or ATM networks as well
                             as Internet-layer (or higher-layer)
                             "tunnels", such as tunnels over IPv4 or
                             IPv6 itself.


3.  Conceptual Configuration Variables

   The CE Router maintains such a list of conceptual optional
   configuration variables.

   1.  Enable an IGP on the LAN.


4.  Architecture

   This document extends the architecture described in
   [I-D.ietf-v6ops-ipv6-cpe-router] to cover a strictly larger set of
   operational scenarios.  In particular, QoS, multicast, DNS, routed
   network in the home, transition technologies, and conceptual
   configuration variables.  This document also extends the model
   described in [I-D.ietf-v6ops-ipv6-cpe-router] to a two router
   topology where the two routers are connected back-to-back (the LAN of
   one router is connected to the WAN of the other router).  This
   topology is depicted below:






















Singh, et al.            Expires April 28, 2011                 [Page 4]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


                        +-------+-------+                   \
                        |   Service     |                    \
                        |   Provider    |                     | Service
                        |    Router     |                     | Provider
                        +-------+-------+                     | network
                                |                             /
                                | Customer                   /
                                | Internet connection       /
                                |
                         +------+--------+                  \
                         |     IPv6      |                   \
                         | Customer Edge |                    \
                         |    Router     |                    |
                         +----+-+-----+--+                    |
             Network A        | |     |   Network B           |
       ----+-------------+----+ |   --+--+-------------+---   |
           |             |    | |        |             |      |
      +----+-----+ +-----+----+ |   +----+-----+ +-----+----+ |
      |IPv6 Host | |IPv6 Host | |   | IPv6 Host| |IPv6 Host | |
      |          | |          | |   |          | |          | |
      +----------+ +-----+----+ |   +----------+ +----------+ |
                                |                             |
                         +------+--------+                    | End-User
                         |     IPv6      |                    | networks
                         |   Interior    |                    |
                         |    Router     |                    |
                         +---+-------+-+-+                    |
             Network C       |       |   Network D            |
       ----+-------------+---+-    --+---+-------------+---   |
           |             |               |             |      |
      +----+-----+ +-----+----+     +----+-----+ +-----+----+ |
      |IPv6 Host | |IPv6 Host |     | IPv6 Host| |IPv6 Host | |
      |          | |          |     |          | |          | /
      +----------+ +-----+----+     +----------+ +----------+/


                                 Figure 1.

   For DNS, the operational expectation is that the end-user would be
   able to access home hosts from the home using DNS names instead of
   more cumbersome IPv6 addresses.  Note that this is distinct from the
   requirement to access home hosts from outside the home.

   End-users are expected to be able to receive multicast video in the
   home without requiring the CE router to include the cost of
   supporting full multicast routing protocols.





Singh, et al.            Expires April 28, 2011                 [Page 5]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


5.  Advanced Features and Feature Requirements

   The IPv6 CE router will need to support connectivity to one or more
   access network architectures.  This document describes an IPv6 CE
   router that is not specific to any particular architecture or Service
   Provider, and supports all commonly used architectures.

5.1.  DNS

   D-1:  For local DNS queries for configuration, the CE Router may
         include a DNS server to handle local queries.  Non-local
         queries can be forwarded unchanged to a DNS server specified in
         the DNS server DHCPv6 option.  The CE Router may also include
         DNS64 functionality which is specified in
         [I-D.bagnulo-behave-dns64].

   D-2:  The local DNS server MAY also handle renumbering from the
         Service Provider provided prefix for local names used
         exclusively inside the home (the local AAAA and PTR records are
         updated).  This capability provides connectivity using local
         DNS names in the home after a Service Provider renumbering.  A
         CE Router MAY add local DNS entries based on dynamic requests
         from the LAN segment(s).  The protocol to carry such requests
         from hosts to the CE Router is yet to be described.

5.2.  Multicast Behavior

   This section is only applicable to a CE Router with at least one LAN
   interface.  A host in the home is expected to receive multicast
   video.  Note the CE Router resides at edge of the home and the
   Service Provider, and the CE Router has at least one WAN connection
   for multiple LAN connections.  In such a multiple LAN to a WAN
   toplogy at the CE Router edge, it is not necessary to run a multicast
   routing protocol and thus MLD Proxy as specified in [RFC4605] can be
   used.  The CE Router discovers the hosts via a MLDv2 Router
   implementation on a LAN interface.  A WAN interface of the CE Router
   interacts with the Service Provider router by sending MLD Reports and
   replying to MLD queries for multicast Group memberships for hosts in
   the home.

   The CE router SHOULD implement MLD Proxy as specified in [RFC4605].
   For the routed topology shown in Figure 1, each router implements a
   MLD Proxy.  If the CE router implements MLD Proxy, the requirements
   on the CE Router for MLD Proxy are listed below.

   WAN requirements, MLD Proxy:





Singh, et al.            Expires April 28, 2011                 [Page 6]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


   WMLD-1:  Consistent with [RFC4605], the CE router MUST NOT implement
            the router portion of MLDv2 for the WAN interface.

   LAN requirements, MLD Proxy:

   LMMLD-1:  The CPE Router MUST follow the model described for MLD
             Proxy in [RFC4605] to implement multicast.

   LMMLD-2:  Consistent with [RFC4605], the LAN interfaces on the CPE
             router MUST NOT implement an MLDv2 Multicast Listener.

   LAN requirements:

   LM-1:  If the CE Router has bridging configured between the LAN
          interfaces, then the LAN interfaces MUST support snooping of
          MLD [RFC3810] messages.

5.3.  ND Proxy

   LAN requirements:

   LNDP-1:  If the CE Router has only one /64 prefix to be used across
            multiple LAN interfaces and the CE Router supports any two
            LAN interfaces that cannot bridge data between them because
            the two interfaces have disparate MAC layers, then the CE
            Router MUST support Proxying Neighbor Advertisements as
            specified in Section 7.2.8 of [RFC4861].  If any two LAN
            interfaces support bridging between the interfaces, then
            Proxying Neighbor Advertisements is not necessary between
            the two interfaces.  Legacy 3GPP networks have the following
            requirements:

            1.  No DHCPv6 prefix is delegated to the CE Router.

            2.  Only one /64 is available on the WAN link.

            3.  The link types between the WAN interface and LAN
                interface(s) are disparate and, therefore, can't be
                bridged.

            4.  No NAT66 is to be used.

            5.  Each LAN interface needs global connectivity.

            6.  Uses SLAAC to configure LAN interface addresses.

            For these legacy 3GPP networks, the CPE Router MUST support
            ND Proxy between the WAN and LAN interface(s).  If a CE



Singh, et al.            Expires April 28, 2011                 [Page 7]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


            Router will never be deployed in an environment with these
            characteristics, then ND Proxy is not necessary.

5.4.  Prefix Delegation on LAN interface(s) (More details are TBD)

   This section is only applicable to a CE Router with at least one LAN
   interface.  The LAN interface(s) are delegated prefixes subnetted
   from the delegated prefix acquired by the WAN interface and the ULA
   prefix.  After the CE router has assigned prefixes for all of its
   internally defined needs (its interfaces and any other purposes
   defined in its internal logic), any leftover prefixes are available
   for delegation.  Any automated prefix delegation mechanism is TBD.

5.5.  Routed network behavior(General Cases TBD)

   CPE Router Behavior in a routed network:

   R-1:  One example of the CPE Router use in the home is shown below.
         The home has a broadband modem combined with a CPE Router, all
         in one device.  The LAN interface of the device is connected to
         another standalone CPE Router that supports a wireless access
         point.  To support such a network, this document recommends
         using prefix delegation of the prefix obtained either via IA_PD
         from WAN interface or a ULA from the LAN interface .  The
         network interface of the downstream router may obtain an IA_PD
         via stateful DHCPv6.  If the CPE router supports the routed
         network through automatic prefix delegation, the CPE router
         MUST support a DHCPv6 server or DHCPv6 relay agent.  Further,
         if an IA_PD is used, the Service Provider or user MUST allocate
         an IA_PD or ULA prefix short enough to be delegated and
         subsequently used for SLAAC.  Therefore, a prefix length
         shorter than /64 is needed.  The CPE Router MAY support and IGP
         in the home network.


                /-------+------------\    /------------+-----\
        SP <--+ Modem | CPE Router    +--+ CPE Router | WAP + --> PC
                \-------+------------/    \------------+-----/

        WAP = Wireless Access Point




                                    Figure 2.






Singh, et al.            Expires April 28, 2011                 [Page 8]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


5.6.  Transition Technologies Support

5.6.1.  Dual-Stack(DS)-Lite

   Even as users migrate from IPv4 to IPv6 addressing, a significant
   percentage of Internet resources and content will remain accessible
   only through IPv4.  Also, many end-user devices will only support
   IPv4.  As a consequence, Service Providers require mechanisms to
   allow customers to continue to access content and resources using
   IPv4 even after the last IPv4 allocations have been fully depleted.
   One technology that can be used for IPv4 address extension is DS-
   Lite.

   DS-Lite enables a Service Provider to share IPv4 addresses among
   multiple customers by combining two well-known technologies: IP in IP
   (IPv4-in-IPv6) tunneling and Carrier Grade NAT.  More specifically,
   Dual-Stack-Lite encapsulates IPv4 traffic inside an IPv6 tunnel at
   the IPv6 CE Router and sends it to a Service Provider Address Family
   Translation Router (AFTR).  Configuration of the IPv6 CE Router to
   support IPv4 LAN traffic is outside the scope of this document.

   The IPv6 CE Router SHOULD implement DS-Lite functionality as
   specified in [I-D.ietf-softwire-dual-stack-lite].

   WAN requirements:

   DLW-1:  To facilitate IPv4 extension over an IPv6 network, if the CE
           Router supports DS-Lite functionality, the CE Router WAN
           interface MUST implement a B4 Interface as specified in
           [I-D.ietf-softwire-dual-stack-lite].

   DLW-2:  If the IPv6 CE Router implements DS-Lite functionality, the
           CE Router MUST support using a DS-Lite DHCPv6 option
           [I-D.ietf-softwire-ds-lite-tunnel-option] to configure the
           DS-Lite tunnel.  The IPv6 CE Router MAY use other mechanisms
           to configure DS-Lite parameters.  Such mechanisms are outside
           the scope of this document.

   DLW-3:  IPv6 CE Router MUST NOT perform IPv4 Network Address
           Translation (NAT) on IPv4 traffic encapsulated using DS-Lite.

   DLW-4:  If the IPv6 CE Router is configured with an non-RFC1918 IPv4
           address on its WAN interface, the IPv6 CE Router MUST disable
           the DS-Lite B4 element.







Singh, et al.            Expires April 28, 2011                 [Page 9]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


   DLW-5:  If DS-Lite is operational on the IPv6 CE Router, multicast
           data MUST NOT be sent on any DS-Lite tunnel.

5.6.2.  6rd

   The IPv6 CE Router can be used to offer IPv6 service to a LAN, even
   when the WAN access network only supports IPv4.  One technology that
   supports IPv6 service over an IPv4 network is IPv6 Rapid Deployment
   (6rd). 6rd encapsulates IPv6 traffic from the end user LAN inside
   IPv4 at the IPv6 CE Router and sends it to a Service Provider Border
   Relay (BR).  The IPv6 CE Router calculates a 6rd delegated IPv6
   prefix during 6rd configuration, and sub-delegates the 6rd delegated
   prefix to devices in the LAN.

   The IPv6 CE Router SHOULD implement 6rd functionality as specified in
   [RFC5969].

   6rd requirements:

   6RD-1:  If the IPv6 CE Router implements 6rd functionality, the CE
           Router WAN interface MUST support at least one 6rd Virtual
           Interface and 6rd CE functionality as specified in [RFC5969].

   6RD-2:  If the IPv6 CE Router implements 6rd CE functionality, it
           MUST support using the 6rd DHCPv4 Option (212) for 6rd
           configuration.  The IPv6 CE Router MAY use other mechanisms
           to configure 6rd parameters.  Such mechanisms are outside the
           scope of this document.

   6RD-3:  If 6rd is operational on the IPv6 CE Router, multicast data
           MUST NOT be sent on any 6rd tunnel.

5.6.3.  Transition Technologies Coexistence

   Run the following four in parallel to provision CPE router
   connectivity to the Service Provider:

   1.  Initiate IPv4 address acquisition.

   2.  Initiate IPv6 address acquisition as specified by
       [I-D.ietf-v6ops-ipv6-cpe-router].

   3.  If 6rd is provisioned, initiate 6rd.

   4.  If DS-Lite is provisioned, initiate DS-Lite.

   The default route for IPv6 through the native physical interface
   should have preference over the 6rd tunnel interface.  The default



Singh, et al.            Expires April 28, 2011                [Page 10]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


   route for IPv4 through the native physical interface should have
   preference over the DS-Lite tunnel interface.

5.7.  Quality Of Service

   Q-1:  The CPE router MAY support differentiated services [RFC2474].

5.8.  Unicast Data Forwarding

   The null route introduced by the WPD-6 requirement in
   [I-D.ietf-v6ops-ipv6-cpe-router] has lower precedence than other
   routes except for the default route.

5.9.  ZeroConf

   The CE Router MAY support manual configuration via the web using a
   URL string like http://router.local as per multicast DNS (mDNS).
   Zero-configuration is vendor-dependent.


6.  Security Considerations

   None.


7.  Acknowledgements

   Thanks to the following people (in alphabetical order) for their
   guidance and feedback:

   Mikael Abrahamsson, Merete Asak, Scott Beuker, Mohamed Boucadair, Rex
   Bullinger, Brian Carpenter, Remi Denis-Courmont, Gert Doering, Alain
   Durand, Katsunori Fukuoka, Tony Hain, Thomas Herbst, Kevin Johns,
   Stephen Kramer, Victor Kuarsingh, Francois-Xavier Le Bail, David
   Miles, Shin Miyakawa, Jean-Francois Mule, Michael Newbery, Carlos
   Pignataro, John Pomeroy, Antonio Querubin, Teemu Savolainen, Matt
   Schmitt, Hiroki Sato, Mark Townsley, Bernie Volz, James Woodyatt, Dan
   Wing and Cor Zwart

   This draft is based in part on CableLabs' eRouter specification.  The
   authors wish to acknowledge the additional contributors from the
   eRouter team:

   Ben Bekele, Amol Bhagwat, Ralph Brown, Eduardo Cardona, Margo Dolas,
   Toerless Eckert, Doc Evans, Roger Fish, Michelle Kuska, Diego
   Mazzola, John McQueen, Harsh Parandekar, Michael Patrick, Saifur
   Rahman, Lakshmi Raman, Ryan Ross, Ron da Silva, Madhu Sudan, Dan
   Torbet and Greg White.



Singh, et al.            Expires April 28, 2011                [Page 11]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


8.  Contributors

   The following people have participated as co-authors or provided
   substantial contributions to this document: Ralph Droms, Kirk
   Erichsen, Fred Baker, Jason Weil, Lee Howard, Jean-Francois Tremblay,
   Yiu Lee, John Jason Brzozowski and Heather Kirksey.


9.  IANA Considerations

   This memo includes no request to IANA.


10.  References

10.1.  Normative References

   [I-D.bagnulo-behave-dns64]
              Bagnulo, M., Sullivan, A., Matthews, P., Beijnum, I., and
              M. Endo, "DNS64: DNS extensions for Network Address
              Translation from IPv6 Clients to  IPv4 Servers",
              draft-bagnulo-behave-dns64-02 (work in progress),
              March 2009.

   [I-D.ietf-softwire-ds-lite-tunnel-option]
              Hankins, D. and T. Mrugalski, "Dynamic Host Configuration
              Protocol for IPv6 (DHCPv6) Option for Dual- Stack Lite",
              draft-ietf-softwire-ds-lite-tunnel-option-05 (work in
              progress), September 2010.

   [I-D.ietf-softwire-dual-stack-lite]
              Durand, A., Droms, R., Woodyatt, J., and Y. Lee, "Dual-
              Stack Lite Broadband Deployments Following IPv4
              Exhaustion", draft-ietf-softwire-dual-stack-lite-06 (work
              in progress), August 2010.

   [I-D.ietf-v6ops-ipv6-cpe-router]
              Singh, H., Beebee, W., Donley, C., Stark, B., and O.
              Troan, "Basic Requirements for IPv6 Customer Edge
              Routers", draft-ietf-v6ops-ipv6-cpe-router-07 (work in
              progress), August 2010.

   [I-D.vyncke-advanced-ipv6-security]
              Vyncke, E. and M. Townsley, "Advanced Security for IPv6
              CPE", draft-vyncke-advanced-ipv6-security-01 (work in
              progress), March 2010.

   [RFC1122]  Braden, R., "Requirements for Internet Hosts -



Singh, et al.            Expires April 28, 2011                [Page 12]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


              Communication Layers", STD 3, RFC 1122, October 1989.

   [RFC2080]  Malkin, G. and R. Minnear, "RIPng for IPv6", RFC 2080,
              January 1997.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2464]  Crawford, M., "Transmission of IPv6 Packets over Ethernet
              Networks", RFC 2464, December 1998.

   [RFC2474]  Nichols, K., Blake, S., Baker, F., and D. Black,
              "Definition of the Differentiated Services Field (DS
              Field) in the IPv4 and IPv6 Headers", RFC 2474,
              December 1998.

   [RFC2827]  Ferguson, P. and D. Senie, "Network Ingress Filtering:
              Defeating Denial of Service Attacks which employ IP Source
              Address Spoofing", BCP 38, RFC 2827, May 2000.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

   [RFC3633]  Troan, O. and R. Droms, "IPv6 Prefix Options for Dynamic
              Host Configuration Protocol (DHCP) version 6", RFC 3633,
              December 2003.

   [RFC3646]  Droms, R., "DNS Configuration options for Dynamic Host
              Configuration Protocol for IPv6 (DHCPv6)", RFC 3646,
              December 2003.

   [RFC3736]  Droms, R., "Stateless Dynamic Host Configuration Protocol
              (DHCP) Service for IPv6", RFC 3736, April 2004.

   [RFC3810]  Vida, R. and L. Costa, "Multicast Listener Discovery
              Version 2 (MLDv2) for IPv6", RFC 3810, June 2004.

   [RFC4075]  Kalusivalingam, V., "Simple Network Time Protocol (SNTP)
              Configuration Option for DHCPv6", RFC 4075, May 2005.

   [RFC4193]  Hinden, R. and B. Haberman, "Unique Local IPv6 Unicast
              Addresses", RFC 4193, October 2005.

   [RFC4242]  Venaas, S., Chown, T., and B. Volz, "Information Refresh
              Time Option for Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 4242, November 2005.




Singh, et al.            Expires April 28, 2011                [Page 13]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


   [RFC4294]  Loughney, J., "IPv6 Node Requirements", RFC 4294,
              April 2006.

   [RFC4443]  Conta, A., Deering, S., and M. Gupta, "Internet Control
              Message Protocol (ICMPv6) for the Internet Protocol
              Version 6 (IPv6) Specification", RFC 4443, March 2006.

   [RFC4541]  Christensen, M., Kimball, K., and F. Solensky,
              "Considerations for Internet Group Management Protocol
              (IGMP) and Multicast Listener Discovery (MLD) Snooping
              Switches", RFC 4541, May 2006.

   [RFC4605]  Fenner, B., He, H., Haberman, B., and H. Sandick,
              "Internet Group Management Protocol (IGMP) / Multicast
              Listener Discovery (MLD)-Based Multicast Forwarding
              ("IGMP/MLD Proxying")", RFC 4605, August 2006.

   [RFC4632]  Fuller, V. and T. Li, "Classless Inter-domain Routing
              (CIDR): The Internet Address Assignment and Aggregation
              Plan", BCP 122, RFC 4632, August 2006.

   [RFC4779]  Asadullah, S., Ahmed, A., Popoviciu, C., Savola, P., and
              J. Palet, "ISP IPv6 Deployment Scenarios in Broadband
              Access Networks", RFC 4779, January 2007.

   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              September 2007.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862, September 2007.

   [RFC4864]  Van de Velde, G., Hain, T., Droms, R., Carpenter, B., and
              E. Klein, "Local Network Protection for IPv6", RFC 4864,
              May 2007.

   [RFC5072]  S.Varada, Haskins, D., and E. Allen, "IP Version 6 over
              PPP", RFC 5072, September 2007.

   [RFC5571]  Storer, B., Pignataro, C., Dos Santos, M., Stevant, B.,
              Toutain, L., and J. Tremblay, "Softwire Hub and Spoke
              Deployment Framework with Layer Two Tunneling Protocol
              Version 2 (L2TPv2)", RFC 5571, June 2009.

   [RFC5969]  Townsley, W. and O. Troan, "IPv6 Rapid Deployment on IPv4
              Infrastructures (6rd) -- Protocol Specification",
              RFC 5969, August 2010.




Singh, et al.            Expires April 28, 2011                [Page 14]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


10.2.  Informative References

   [I-D.ietf-behave-v6v4-framework]
              Baker, F., Li, X., Bao, C., and K. Yin, "Framework for
              IPv4/IPv6 Translation",
              draft-ietf-behave-v6v4-framework-10 (work in progress),
              August 2010.

   [UPnP-IGD]
              UPnP Forum, "Universal Plug and Play (UPnP) Internet
              Gateway Device (IGD)", November 2001,
              <http://www.upnp.org/standardizeddcps/igd.asp>.


Authors' Addresses

   Hemant Singh
   Cisco Systems, Inc.
   1414 Massachusetts Ave.
   Boxborough, MA  01719
   USA

   Phone: +1 978 936 1622
   Email: shemant@cisco.com
   URI:   http://www.cisco.com/


   Wes Beebee
   Cisco Systems, Inc.
   1414 Massachusetts Ave.
   Boxborough, MA  01719
   USA

   Phone: +1 978 936 2030
   Email: wbeebee@cisco.com
   URI:   http://www.cisco.com/


   Chris Donley
   CableLabs
   858 Coal Creek Circle
   Louisville, CO  80027
   USA

   Email: c.donley@cablelabs.com






Singh, et al.            Expires April 28, 2011                [Page 15]

Internet-Draft    IPv6 CE router Advanced requirements      October 2010


   Barbara Stark
   AT&T
   725 W Peachtree St
   Atlanta, GA  30308
   USA

   Email: barbara.stark@att.com


   Ole Troan (editor)
   Cisco Systems, Inc.
   Veversmauet 8
   N-5017 BERGEN,
   Norway

   Email: ot@cisco.com



































Singh, et al.            Expires April 28, 2011                [Page 16]


